---
kind: property
id: P:Autodesk.Revit.DB.CADLinkOptions.ViewId
source: html/0a19b743-8512-da8b-006d-cd703987310d.htm
---
# Autodesk.Revit.DB.CADLinkOptions.ViewId Property

The id of the view to use as the link's reference view, if the
 reference view has been deleted.

## Syntax (C#)
```csharp
public ElementId ViewId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null